NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_application.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR_NS</name>
      <description>User information configuration registers</description>
      <baseAddress>0x0FFF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x200</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DATA[%s]</name>
          <description>Description collection: Generic data register array.</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BICR_NS</name>
      <description>Board information configuration registers</description>
      <baseAddress>0x0FFF87B0</baseAddress>
      <alternatePeripheral>UICR_NS</alternatePeripheral>
      <headerStructName>BICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>BICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>POWER</name>
          <description>Unspecified</description>
          <headerStructName>BICR_POWER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Power configuration of power rails.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VDDAO5V0</name>
                <description>VDD_AO_5V0 power configuration.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Power rail is unconfigured.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Power rail is configured to be externally powered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Power rail is shorted to VDD_AO_1V8. Can only be used if VDDAO1V8 field is External.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDAO1V8</name>
                <description>VDD_AO_1V8 power configuration.</description>
                <lsb>2</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Power rail is unconfigured.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Power rail is configured to use the internal regulator.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Power rail is configured to be externally powered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDD1V0</name>
                <description>VDD_1V0 power configuration.</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Power rail is unconfigured.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Power rail is configured to use the internal regulator.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Power rail is configured to be externally powered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDRF1V0</name>
                <description>VDD_RF_1V0 power configuration.</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Power rail is unconfigured or disconnected.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Power rail is configured to be externally powered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Power rail is shorted to VDD_1V0.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDAO0V8</name>
                <description>VDD_AO_0V8 power configuration.</description>
                <lsb>8</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Power rail is unconfigured.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Power rail is configured to use the internal regulator.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Power rail is configured to be externally powered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VDDVS0V8</name>
                <description>VDD_VS_0V8 power configuration.</description>
                <lsb>10</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Power rail is unconfigured.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Internal</name>
                    <description>Power rail is configured to use the internal regulator.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External</name>
                    <description>Power rail is configured to be externally powered.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INDUCTOR</name>
                <description>DC/DC inductor presence.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotPresent</name>
                    <description>DC/DC inductor is not present.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Present</name>
                    <description>DC/DC inductor is present.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>IOPORT</name>
          <description>Unspecified</description>
          <headerStructName>BICR_IOPORT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x004</addressOffset>
          <register>
            <name>POWER0</name>
            <description>Power configuration for P0 to P7 IO ports. Note: P0 is not included in the fields of this register because it is always internally supplied.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>P1</name>
                <description>P1 power configuration.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Port supply rail is not connected. Port cannot be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Port supply is shorted on the PCB to VDD_AO_1V8.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External1V8</name>
                    <description>Port supply is provided externally at 1.8 V. Use this option if the port is supplied through SWEXT.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>P2</name>
                <description>P2 power configuration.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Port supply rail is not connected. Port cannot be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Port supply is shorted on the PCB to VDD_AO_1V8.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External1V8</name>
                    <description>Port supply is provided externally at 1.8 V. Use this option if the port is supplied through SWEXT.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>P6</name>
                <description>P6 power configuration.</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Port supply rail is not connected. Port cannot be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Port supply is shorted on the PCB to VDD_AO_1V8.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External1V8</name>
                    <description>Port supply is provided externally at 1.8 V. Use this option if the port is supplied through SWEXT.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>P7</name>
                <description>P7 power configuration.</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Port supply rail is not connected. Port cannot be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Port supply is shorted on the PCB to VDD_AO_1V8.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External1V8</name>
                    <description>Port supply is provided externally at 1.8 V. Use this option if the port is supplied through SWEXT.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>POWER1</name>
            <description>Power configuration for P8 to P15 IO ports.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>P9</name>
                <description>P9 power configuration.</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Port supply rail is not connected. Port cannot be used.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Shorted</name>
                    <description>Port supply is shorted on the PCB to VDD_AO_1V8.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>External1V8</name>
                    <description>Port supply is provided externally at 1.8 V. Use this option if the port is supplied through SWEXT.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ExternalFull</name>
                    <description>Port supply is provided externally with a full range of values, from 3 V to 1.8 V.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DRIVECTRL0</name>
            <description>Drive control configuration for P0 to P7 IO ports.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>P6</name>
                <description>P6 drive control configuration.</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured. PORTCNF.DRIVECTRL will not be adjusted.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms33</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms40</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms50</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms66</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms100</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>P7</name>
                <description>P7 drive control configuration.</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unconfigured</name>
                    <description>Port supply is unconfigured. PORTCNF.DRIVECTRL will not be adjusted.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms33</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 33 Ohms.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms40</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 40 Ohms.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms50</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 50 Ohms.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms66</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 66 Ohms.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Ohms100</name>
                    <description>PORTCNF.DRIVECTRL will be adjusted for 100 Ohms.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
