NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_application.svd
        <register>
          <name>RXESC</name>
          <description>Rx Buffer / FIFO Element Size Configuration</description>
          <addressOffset>0x0BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>F0DS</name>
              <description>Rx FIFO 0 Data Field Size</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DataField8B</name>
                  <description>8 byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField12B</name>
                  <description>12 byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField16B</name>
                  <description>16 byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField20B</name>
                  <description>20 byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField24B</name>
                  <description>24 byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField32B</name>
                  <description>32 byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField48B</name>
                  <description>48 byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField64B</name>
                  <description>64 byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>F1DS</name>
              <description>Rx FIFO 1 Data Field Size</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DataField8B</name>
                  <description>8 byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField12B</name>
                  <description>12 byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField16B</name>
                  <description>16 byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField20B</name>
                  <description>20 byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField24B</name>
                  <description>24 byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField32B</name>
                  <description>32 byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField48B</name>
                  <description>48 byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField64B</name>
                  <description>64 byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBDS</name>
              <description>Rx Buffer Data Field Size</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DataField8B</name>
                  <description>8 byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField12B</name>
                  <description>12 byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField16B</name>
                  <description>16 byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField20B</name>
                  <description>20 byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField24B</name>
                  <description>24 byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField32B</name>
                  <description>32 byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField48B</name>
                  <description>48 byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField64B</name>
                  <description>64 byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBC</name>
          <description>Tx Buffer Configuration</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TBSA</name>
              <description>Tx Buffers Start Address</description>
              <lsb>2</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NDTB</name>
              <description>Number of Dedicated Transmit Buffers</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>TFQS</name>
              <description>Transmit FIFO/Queue Size</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>TFQM</name>
              <description>Tx FIFO/Queue Mode</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TxFIFO</name>
                  <description>Tx FIFO operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxQueue</name>
                  <description>Tx Queue operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFQS</name>
          <description>Tx FIFO/Queue Status</description>
          <addressOffset>0x0C4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TFFL</name>
              <description>Tx FIFO Free Level</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>TFGI</name>
              <description>Tx FIFO Get Index</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TFQPI</name>
              <description>Tx FIFO/Queue Put Index</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>TFQF</name>
              <description>Tx FIFO/Queue Full</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFull</name>
                  <description>Tx FIFO/Queue not full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full</name>
                  <description>Tx FIFO/Queue full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXESC</name>
          <description>Tx Buffer Element Size Configuration</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TBDS</name>
              <description>Tx Buffer Data Field Size</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DataField8B</name>
                  <description>8 byte data field</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField12B</name>
                  <description>12 byte data field</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField16B</name>
                  <description>16 byte data field</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField20B</name>
                  <description>20 byte data field</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField24B</name>
                  <description>24 byte data field</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField32B</name>
                  <description>32 byte data field</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField48B</name>
                  <description>48 byte data field</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DataField64B</name>
                  <description>64 byte data field</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBRP</name>
          <description>Tx Buffer Request Pending</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRP</name>
              <description>Transmission Request Pending</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRequest</name>
                  <description>No transmission request pending</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Request</name>
                  <description>Transmission request pending</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBAR</name>
          <description>Tx Buffer Add Request</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AR</name>
              <description>Add Request</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRequest</name>
                  <description>No transmission request added</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Request</name>
                  <description>Transmission requested added</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCR</name>
          <description>Tx Buffer Cancellation Request</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CR</name>
              <description>Cancellation Request</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoCancellation</name>
                  <description>No cancellation pending</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cancellation</name>
                  <description>Cancellation pending</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBTO</name>
          <description>Tx Buffer Transmission Occurred</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TO</name>
              <description>Transmission Occurred</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoTransmittion</name>
                  <description>No transmission occurred</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Transmittion</name>
                  <description>Transmission occurred</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCF</name>
          <description>Tx Buffer Cancellation Finished</description>
          <addressOffset>0x0DC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CF</name>
              <description>Cancellation Finished</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoCancellation</name>
                  <description>No transmit buffer cancellation</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CancellationFinished</name>
                  <description>Transmit buffer cancellation finished</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBTIE</name>
          <description>Tx Buffer Transmission Interrupt Enable</description>
          <addressOffset>0x0E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIE</name>
              <description>Transmission Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Transmission interrupt disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Transmission interrupt enable</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCIE</name>
          <description>Tx Buffer Cancellation Finished Interrupt Enable</description>
          <addressOffset>0x0E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CFIE</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Cancellation finished interrupt disabled</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Cancellation finished interrupt enabled</description>
                  <value>0x00000001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFC</name>
          <description>Tx Event FIFO Configuration</description>
          <addressOffset>0x0F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EFSA</name>
              <description>Event FIFO Start Address</description>
              <lsb>2</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>EFS</name>
              <description>Event FIFO Size</description>
              <lsb>16</lsb>
              <msb>21</msb>
            </field>
            <field>
              <name>EFWM</name>
              <description>Event FIFO Watermark</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFS</name>
          <description>Tx Event FIFO Status</description>
          <addressOffset>0x0F4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EFFL</name>
              <description>Event FIFO Fill Level</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>EFGI</name>
              <description>Event FIFO Get Index</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>EFPI</name>
              <description>Event FIFO Put Index</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>EFF</name>
              <description>Event FIFO Full</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotFull</name>
                  <description>Tx Event FIFO not full</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Full</name>
                  <description>Tx Event FIFO full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLost</name>
                  <description>No Tx Event FIFO element lost</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Lost</name>
                  <description>Tx Event FIFO element lost, also set after wr ite attempt to Tx Event FIFO of siz e zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFA</name>
          <description>Tx Event FIFO Acknowledge</description>
          <addressOffset>0x0F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EFAI</name>
              <description>Event FIFO Acknowledge Index</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
