NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_application.svd
        <register>
          <name>DMUIR</name>
          <description>DMU Interrupt Register</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXENSA</name>
              <description>TX Element Not Start Address</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal write access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Write to TX Element begins without using start address, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEIE</name>
              <description>TX Element Illegal Enqueueing</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal enqueueing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Start of enqueueing without request detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEIAS</name>
              <description>TX Element Illegal Access Sequence</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal addressing sequence detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Accesses are not strictly linear to ascending and consecutive addresses, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEIDLC</name>
              <description>TX Element Illegal DLC</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal DLC detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>DLC exceeds Tx Buffer element size of MCAN, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEWATA</name>
              <description>TX Element Write After Trigger Address</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No write after Trigger Address</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Write after Trigger address detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEIR</name>
              <description>TX Element Illegal Read</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No read access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Illegal read access to DMU TX Element section detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEE</name>
              <description>A successful enqueueing of a Tx message with the DMU TX Element section sets this flag.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Tx message enqueued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Tx message successfully enqueued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0ENSA</name>
              <description>RX0 Element Not Start Address</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal read access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Read from RX0 Element begins without using start address, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0EID</name>
              <description>RX0 Element Illegal Dequeueing</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal dequeueing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Start of dequeueing without request detected, exception recovery started,</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0EIAS</name>
              <description>RX0 Element Illegal Access Sequence</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal addressing sequence detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Accesses are not strictly linear to ascending and consecutive addresses, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0EIW</name>
              <description>RX0 Element Illegal Write</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No write access detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Illegal write access to DMU RX0 Element detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0ED</name>
              <description>RX0 Element Dequeued</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Rx message dequeued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx message successfully dequeued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0EIO</name>
              <description>RX0 Element Illegal Overwrite by timestamp</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal overwrite detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>DMU has internally overwritten the last element word of a SYNC message</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEU</name>
              <description>Bus Error Uncorrected</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No read slave error detected when reading from Message RAM</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Read slave error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1ENSA</name>
              <description>RX1 Element Not Start Address</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal read access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Read from RX1 Element begins without using start address, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1EID</name>
              <description>RX1 Element Illegal Dequeueing</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal dequeueing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Start of dequeueing without request detected, exception recovery started,</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1EIAS</name>
              <description>RX0 Element Illegal Access Sequence</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal addressing sequence detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Accesses are not strictly linear to ascending and consecutive addresses, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1EIW</name>
              <description>RX1 Element Illegal Write</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No write access detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Illegal write access to DMU RX1 Element detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1ED</name>
              <description>RX0 Element Dequeued</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No Rx message dequeued</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Rx message successfully dequeued</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1EIO</name>
              <description>RX1 Element Illegal Overwrite by timestamp</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal overwrite detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>DMU has internally overwritten the last element word of a SYNC message</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEENSA</name>
              <description>TX Event Element Not Start Address</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal read access</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Read from TX Event Element begins without using start address, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEEID</name>
              <description>TX Event Element Illegal Dequeueing</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal dequeueing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Start of dequeueing without request detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEEIAS</name>
              <description>TX Event Element Illegal Access Sequence</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No illegal addressing sequence detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Accesses are not strictly linear to ascending and consecutive addresses, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEEIW</name>
              <description>TX Event Element Illegal Write</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Write '1' to clear interrupt flag</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>No write access detected</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Illegal write access to DMU TX Event Element detected, exception recovery started.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEED</name>
              <description>TX Event Element Dequeued</description>
              <lsb>28</lsb>
