NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>WDT010_S</name>
      <description>Watchdog Timer 1</description>
      <baseAddress>0x52014000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT010</name>
        <value>20</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>WDT011_NS</name>
      <description>Watchdog Timer 2</description>
      <baseAddress>0x42015000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT011</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>WDT011_S</name>
      <description>Watchdog Timer 3</description>
      <baseAddress>0x52015000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT011</name>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ABB_NS</name>
      <description>ABB peripheral 0</description>
      <baseAddress>0x4201C000</baseAddress>
      <headerStructName>ABB</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>ABB</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>STATUS</name>
          <description>ABB status</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPPOINT</name>
              <description>The current ABB operating point</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OpPoint0V4</name>
                  <description>Operating point 0.4V</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V5</name>
                  <description>Operating point 0.5V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V6</name>
                  <description>Operating point 0.6V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V8</name>
                  <description>Operating point 0.8V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>The ABB enable status.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>ABB disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>ABB enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKED</name>
              <description>The ABB lock status.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotLocked</name>
                  <description>Not locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>ABB control</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPPOINT</name>
              <description>The ABB operating point.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The peripheral controls the operating point automatically based on request from the
                    master ABB controller.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V4</name>
                  <description>Force the operating point to 0.4V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V5</name>
                  <description>Force the operating point to 0.5V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V6</name>
                  <description>Force the operating point to 0.6V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpPoint0V8</name>
                  <description>Force the operating point to 0.8V</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ABBEN</name>
              <description>Enable ABB.</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>The peripheral controls the ABB enable automatically based on request.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Force enable ABB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Force disable ABB</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
