NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_application.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TBM_NS">
      <name>GLOBAL_TBM_S</name>
      <description>Trace buffer monitor 1</description>
      <baseAddress>0xBF003000</baseAddress>
      <alternatePeripheral>GLOBAL_TBM_NS</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TBM</name>
        <value>127</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_USBHS_NS</name>
      <description>USBHS 0</description>
      <baseAddress>0x4F086000</baseAddress>
      <headerStructName>USBHS</headerStructName>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBHS</name>
        <value>134</value>
      </interrupt>
      <groupName>USBHS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Start the USB peripheral.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start the USB peripheral.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop the USB peripheral</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop the USB peripheral</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_START</name>
          <description>Subscribe configuration for task START</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task START will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_STOP</name>
          <description>Subscribe configuration for task STOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that task STOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_CORE</name>
          <description>Event indicating that interrupt triggered at USBHS core</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_CORE</name>
              <description>Event indicating that interrupt triggered at USBHS core</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_CORE</name>
          <description>Publish configuration for event CORE</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>DPPI channel that event CORE will publish to</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE</name>
              <description>Write '1' to enable interrupt for event CORE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE</name>
              <description>Write '1' to disable interrupt for event CORE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPEND</name>
          <description>Pending interrupts</description>
          <addressOffset>0x30C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE</name>
              <description>Read pending status of interrupt for event CORE</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable USB peripheral.</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CORE</name>
              <description>Enable USB Controller</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>USB Controller disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>USB Controller enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHY</name>
              <description>Enable USB PHY</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>USB PHY disabled.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>USB PHY enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PHY</name>
          <description>Unspecified</description>
          <headerStructName>USBHS_PHY</headerStructName>
          <access>read-write</access>
          <addressOffset>0x440</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>USB PHY parameter overrides</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x5533D6F0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PLLITUNE</name>
                <description>PLL Integral Path Tune</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PLLPTUNE</name>
                <description>PLL Proportional Path Tune</description>
                <lsb>2</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>COMPDISTUNE0</name>
                <description>Disconnect Threshold Adjustment</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>SQRXTUNE0</name>
                <description>Squelch Threshold Adjustment</description>
                <lsb>9</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>VDATREFTUNE0</name>
                <description>Data Detect Voltage Adjustment</description>
                <lsb>12</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>TXHSXVTUNE0</name>
                <description>Transmitter High-Speed Crossover Adjustment</description>
                <lsb>14</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TXFSLSTUNE0</name>
                <description>FS/LS Source Impedance Adjustment</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>TXVREFTUNE0</name>
                <description>HS DC Voltage Level Adjustment</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TXRISETUNE0</name>
                <description>HS Transmitter Rise/Fall Time Adjustment</description>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>TXRESTUNE0</name>
                <description>USB Source Impedance Adjustment</description>
                <lsb>26</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>TXPREEMPAMPTUNE0</name>
                <description>HS Transmitter Pre-Emphasis Current Control</description>
                <lsb>28</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>TXPREEMPPULSETUNE0</name>
                <description>HS Transmitter Pre-Emphasis Duration Control</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOCK</name>
            <description>USB PHY clock configurations</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000001A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FSEL</name>
                <description>Select reference clock frequency</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Clock19200KHz</name>
                    <description>Reference clock is 19.2MHz.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock20000KHz</name>
                    <description>Reference clock is 20MHz.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock24000KHz</name>
                    <description>Reference clock is 24MHz.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Clock50000KHz</name>
                    <description>Reference clock is 50MHz.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PLLBTUNE</name>
                <description>PLL bandwidth adjustment</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>PLL bandwidth adjustment disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>PLL bandwidth adjustment enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMMONONN</name>
                <description>Common block power down control</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>POWERED</name>
                    <description>The REFCLOCK_LOGIC,bias and PLL blocks are powered in sleep or suspend mode.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SUSPEND</name>
                    <description>The REFCLOCK_LOGIC, bias and PLL blocks are powered down in suspend mode and bias and PLL
          blocks are powered down in sleep mode.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OVERRIDEVALUES</name>
            <description>Values that are used to override the input signals to the PHY.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x04000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DPPULLDOWN</name>
                <description>This field controls the pull-down resistor on D+</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>The pull-down resistor on D+ is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>The pull-down resistor on D+ is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DMPULLDOWN</name>
                <description>This field controls the pull-down resistor on D-</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>The pull-down resistor on D+ is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>The pull-down resistor on D+ is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SLEEPM0</name>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
            </fields>
          </register>
        </cluster>
